#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.kms.data.aws_partition.current[0]: Reading...
module.aurora.data.aws_partition.current: Reading...
module.aurora.aws_db_parameter_group.this[0]: Refreshing state... [id=ex-terraform-20231123143328630300000002]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-044efb698cb403a17]
module.kms.data.aws_caller_identity.current[0]: Reading...
module.aurora.data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.aurora.aws_rds_cluster_parameter_group.this[0]: Refreshing state... [id=ex-terraform-20231123143328628700000001]
module.aurora.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/cluster/ex-terraform/postgresql]
module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=421195411089]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1476794262]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=2c0f0973-38d2-4ae9-8a61-f29db3060e21]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.kms.aws_kms_alias.this["ex-terraform"]: Refreshing state... [id=alias/ex-terraform]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01b16e52e5b5ccf5e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e578c054e6b185ad]
module.aurora.aws_security_group.this[0]: Refreshing state... [id=sg-06bb6dce3b064e363]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-03514ce51eba6427d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05b70011a8c7d640e]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-025429351da092e13]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0ac7a999b3424866a]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0b004406173a6017d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01339c9089ab21518]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0f0ef0845f3a8c35c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-00beb3c87a4432c65]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05f010a2241ec1613]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0cb6c45ecd9490826]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-027fb849a38e07d06]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01b22f852ceb4f70b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06caa3be868889a4e]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-002e6c51a0231f7ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-054839fb040e148c1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05b70011a8c7d640e1080289494]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0ac54ea0e6437caed]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-09342ddb738056cad]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0d82d49eeaf6e61fa]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e4e5d0a916c95e19]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07f71d2356e9b21e9]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0515881108314a93e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06444d21e4fe5ccd4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01620a64c814f743d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c532f2966c6858fa]
module.aurora.aws_security_group_rule.this["egress_example"]: Refreshing state... [id=sgrule-3928176726]
module.aurora.aws_security_group_rule.this["vpc_ingress"]: Refreshing state... [id=sgrule-2271026743]
module.aurora.aws_rds_cluster.this[0]: Refreshing state... [id=ex-terraform]
module.aurora.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=ex-terraform-1]
module.aurora.aws_rds_cluster_activity_stream.this[0]: Refreshing state... [id=arn:aws:rds:us-east-1:421195411089:cluster:ex-terraform]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aurora.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ cluster_members                     = [
          + "ex-terraform-1",
        ]
        id                                  = "ex-terraform"
        tags                                = {
            "Example"    = "ex-terraform"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
        # (39 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.aurora.aws_cloudwatch_log_group.this["postgresql"] must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-east-1:421195411089:log-group:/aws/rds/cluster/ex-terraform/postgresql" -> (known after apply)
      ~ id                = "/aws/rds/cluster/ex-terraform/postgresql" -> (known after apply)
      ~ name              = "/aws/rds/cluster/ex-terraform/postgresql" -> "/aws/rds/cluster/ex-terraform-aurora-postgresql/postgresql" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all          = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.aurora.aws_db_parameter_group.this[0] must be replaced
+/- resource "aws_db_parameter_group" "this" {
      ~ arn         = "arn:aws:rds:us-east-1:421195411089:pg:ex-terraform-20231123143328630300000002" -> (known after apply)
      ~ description = "ex-terraform example DB parameter group" -> "ex-terraform-aurora-postgresql example DB parameter group" # forces replacement
      ~ id          = "ex-terraform-20231123143328630300000002" -> (known after apply)
      ~ name        = "ex-terraform-20231123143328630300000002" -> (known after apply)
      ~ name_prefix = "ex-terraform-" -> "ex-terraform-aurora-postgresql-" # forces replacement
      ~ tags        = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all    = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.aurora.aws_rds_cluster.this[0] must be replaced
-/+ resource "aws_rds_cluster" "this" {
      ~ allocated_storage                   = 1 -> (known after apply)
      ~ arn                                 = "arn:aws:rds:us-east-1:421195411089:cluster:ex-terraform" -> (known after apply)
      ~ availability_zones                  = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ cluster_identifier                  = "ex-terraform" -> "ex-terraform-aurora-postgresql" # forces replacement
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [
          - "ex-terraform-1",
        ] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-ZF46UPCTWFEIPFTBZAKWV5KAUA" -> (known after apply)
      + database_name                       = (known after apply)
      ~ db_cluster_parameter_group_name     = "ex-terraform-20231123143328628700000001" -> (known after apply)
      ~ db_subnet_group_name                = "ex-terraform" -> "ex-terraform-aurora-postgresql" # forces replacement
      + db_system_id                        = (known after apply)
      - deletion_protection                 = false -> null
      ~ endpoint                            = "ex-terraform.cluster-c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual               = "14.7" -> (known after apply)
      ~ hosted_zone_id                      = "Z2R2ITUGPM61AM" -> (known after apply)
      - iam_database_authentication_enabled = false -> null
      ~ iam_roles                           = [] -> (known after apply)
      ~ id                                  = "ex-terraform" -> (known after apply)
      - iops                                = 0 -> null
      ~ kms_key_id                          = "arn:aws:kms:us-east-1:421195411089:key/9ca9be06-f261-4e2d-a661-91b797bc2b51" -> (known after apply)
      ~ master_user_secret                  = [
          - {
              - kms_key_id    = "arn:aws:kms:us-east-1:421195411089:key/d0e23840-2941-49e2-b07d-695185ef30d9"
              - secret_arn    = "arn:aws:secretsmanager:us-east-1:421195411089:secret:rds!cluster-0e78fb4d-42cd-4340-a1e4-417ee4b30082-JITI0g"
              - secret_status = "active"
            },
        ] -> (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      ~ network_type                        = "IPV4" -> (known after apply)
      ~ reader_endpoint                     = "ex-terraform.cluster-ro-c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
      + storage_type                        = "aurora-iopt1"
      ~ tags                                = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all                            = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids              = [
          - "sg-06bb6dce3b064e363",
        ] -> (known after apply)
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aurora.aws_rds_cluster_activity_stream.this[0] must be replaced
-/+ resource "aws_rds_cluster_activity_stream" "this" {
      ~ id                                  = "arn:aws:rds:us-east-1:421195411089:cluster:ex-terraform" -> (known after apply)
      ~ kinesis_stream_name                 = "aws-rds-das-cluster-ZF46UPCTWFEIPFTBZAKWV5KAUA" -> (known after apply)
      ~ resource_arn                        = "arn:aws:rds:us-east-1:421195411089:cluster:ex-terraform" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.aurora.aws_rds_cluster_instance.this["1"] must be replaced
-/+ resource "aws_rds_cluster_instance" "this" {
      ~ arn                                   = "arn:aws:rds:us-east-1:421195411089:db:ex-terraform-1" -> (known after apply)
      ~ availability_zone                     = "us-east-1c" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      ~ cluster_identifier                    = "ex-terraform" # forces replacement -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "ex-terraform-20231123143328630300000002" -> (known after apply)
      ~ db_subnet_group_name                  = "ex-terraform" -> "ex-terraform-aurora-postgresql" # forces replacement
      ~ dbi_resource_id                       = "db-FRP7P3DQPJWMZY5VRWACCY5PGA" -> (known after apply)
      ~ endpoint                              = "ex-terraform-1.c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "14.7" -> (known after apply)
      ~ id                                    = "ex-terraform-1" -> (known after apply)
      ~ identifier                            = "ex-terraform-1" -> "ex-terraform-aurora-postgresql-1" # forces replacement
      + identifier_prefix                     = (known after apply)
      ~ kms_key_id                            = "arn:aws:kms:us-east-1:421195411089:key/9ca9be06-f261-4e2d-a661-91b797bc2b51" -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ performance_insights_enabled          = false -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "02:00-03:00" -> (known after apply)
      ~ storage_encrypted                     = true -> (known after apply)
      ~ tags                                  = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all                              = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
      ~ writer                                = true -> (known after apply)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aurora.aws_rds_cluster_parameter_group.this[0] must be replaced
+/- resource "aws_rds_cluster_parameter_group" "this" {
      ~ arn         = "arn:aws:rds:us-east-1:421195411089:cluster-pg:ex-terraform-20231123143328628700000001" -> (known after apply)
      ~ description = "ex-terraform example cluster parameter group" -> "ex-terraform-aurora-postgresql example cluster parameter group" # forces replacement
      ~ id          = "ex-terraform-20231123143328628700000001" -> (known after apply)
      ~ name        = "ex-terraform-20231123143328628700000001" -> (known after apply)
      ~ name_prefix = "ex-terraform-" -> "ex-terraform-aurora-postgresql-" # forces replacement
      ~ tags        = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all    = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aurora.aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:us-east-1:421195411089:security-group/sg-06bb6dce3b064e363" -> (known after apply)
      ~ description            = "Control traffic to/from RDS Aurora ex-terraform" -> "Control traffic to/from RDS Aurora ex-terraform-aurora-postgresql" # forces replacement
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-06bb6dce3b064e363" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.3.0/24",
                  - "10.0.4.0/24",
                  - "10.0.5.0/24",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "10.33.0.0/28",
                ]
              - description      = "Egress to corporate printer closet"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ name                   = "ex-terraform-20231123143347374400000003" -> (known after apply)
      ~ name_prefix            = "ex-terraform-" -> "ex-terraform-aurora-postgresql-" # forces replacement
      ~ owner_id               = "421195411089" -> (known after apply)
      ~ tags                   = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
        }
      ~ tags_all               = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.aurora.aws_security_group_rule.this["egress_example"] must be replaced
-/+ resource "aws_security_group_rule" "this" {
      ~ id                       = "sgrule-3928176726" -> (known after apply)
      ~ security_group_id        = "sg-06bb6dce3b064e363" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-00734633be5ed29e3" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aurora.aws_security_group_rule.this["vpc_ingress"] must be replaced
-/+ resource "aws_security_group_rule" "this" {
      ~ id                       = "sgrule-2271026743" -> (known after apply)
      ~ security_group_id        = "sg-06bb6dce3b064e363" # forces replacement -> (known after apply) # forces replacement
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kms.aws_kms_alias.this["ex-terraform"] will be destroyed
  # (because key ["ex-terraform"] is not in for_each map)
  - resource "aws_kms_alias" "this" {
      - arn            = "arn:aws:kms:us-east-1:421195411089:alias/ex-terraform" -> null
      - id             = "alias/ex-terraform" -> null
      - name           = "alias/ex-terraform" -> null
      - target_key_arn = "arn:aws:kms:us-east-1:421195411089:key/2c0f0973-38d2-4ae9-8a61-f29db3060e21" -> null
      - target_key_id  = "2c0f0973-38d2-4ae9-8a61-f29db3060e21" -> null
    }

  # module.kms.aws_kms_alias.this["ex-terraform-aurora-postgresql"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ex-terraform-aurora-postgresql"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "2c0f0973-38d2-4ae9-8a61-f29db3060e21"
    }

  # module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "KMS key for ex-terraform cluster activity stream." -> "KMS key for ex-terraform-aurora-postgresql cluster activity stream."
        id                                 = "2c0f0973-38d2-4ae9-8a61-f29db3060e21"
      ~ tags                               = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
        }
      ~ tags_all                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_db_subnet_group.database[0] must be replaced
-/+ resource "aws_db_subnet_group" "database" {
      ~ arn                     = "arn:aws:rds:us-east-1:421195411089:subgrp:ex-terraform" -> (known after apply)
      ~ description             = "Database subnet group for ex-terraform" -> "Database subnet group for ex-terraform-aurora-postgresql"
      ~ id                      = "ex-terraform" -> (known after apply)
      ~ name                    = "ex-terraform" -> "ex-terraform-aurora-postgresql" # forces replacement
      + name_prefix             = (known after apply)
      ~ supported_network_types = [
          - "IPV4",
        ] -> (known after apply)
      ~ tags                    = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
        }
      ~ tags_all                = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                  = "vpc-044efb698cb403a17" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-03514ce51eba6427d"
      ~ tags                   = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
        }
      ~ tags_all               = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0e578c054e6b185ad"
      ~ tags                   = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
        }
      ~ tags_all               = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-01b16e52e5b5ccf5e"
        name                   = "default"
      ~ tags                   = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
        }
      ~ tags_all               = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-default" -> "ex-terraform-aurora-postgresql-default"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-05f010a2241ec1613"
      ~ tags     = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
        }
      ~ tags_all = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-01339c9089ab21518"
      ~ tags             = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1a" -> "ex-terraform-aurora-postgresql-private-us-east-1a"
        }
      ~ tags_all         = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1a" -> "ex-terraform-aurora-postgresql-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f0ef0845f3a8c35c"
      ~ tags             = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1b" -> "ex-terraform-aurora-postgresql-private-us-east-1b"
        }
      ~ tags_all         = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1b" -> "ex-terraform-aurora-postgresql-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-00beb3c87a4432c65"
      ~ tags             = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1c" -> "ex-terraform-aurora-postgresql-private-us-east-1c"
        }
      ~ tags_all         = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1c" -> "ex-terraform-aurora-postgresql-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-05b70011a8c7d640e"
      ~ tags             = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-public" -> "ex-terraform-aurora-postgresql-public"
        }
      ~ tags_all         = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-public" -> "ex-terraform-aurora-postgresql-public"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[0] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0b004406173a6017d"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-db-us-east-1a" -> "ex-terraform-aurora-postgresql-db-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-db-us-east-1a" -> "ex-terraform-aurora-postgresql-db-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[1] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0ac7a999b3424866a"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-db-us-east-1b" -> "ex-terraform-aurora-postgresql-db-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-db-us-east-1b" -> "ex-terraform-aurora-postgresql-db-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[2] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-025429351da092e13"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-db-us-east-1c" -> "ex-terraform-aurora-postgresql-db-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-db-us-east-1c" -> "ex-terraform-aurora-postgresql-db-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-06caa3be868889a4e"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1a" -> "ex-terraform-aurora-postgresql-private-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1a" -> "ex-terraform-aurora-postgresql-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-054839fb040e148c1"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1b" -> "ex-terraform-aurora-postgresql-private-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1b" -> "ex-terraform-aurora-postgresql-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-002e6c51a0231f7ac"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-private-us-east-1c" -> "ex-terraform-aurora-postgresql-private-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-private-us-east-1c" -> "ex-terraform-aurora-postgresql-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-027fb849a38e07d06"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-public-us-east-1a" -> "ex-terraform-aurora-postgresql-public-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-public-us-east-1a" -> "ex-terraform-aurora-postgresql-public-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0cb6c45ecd9490826"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-public-us-east-1b" -> "ex-terraform-aurora-postgresql-public-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-public-us-east-1b" -> "ex-terraform-aurora-postgresql-public-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01b22f852ceb4f70b"
      ~ tags                                           = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform-public-us-east-1c" -> "ex-terraform-aurora-postgresql-public-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform-public-us-east-1c" -> "ex-terraform-aurora-postgresql-public-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-044efb698cb403a17"
      ~ tags                                 = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-rds-aurora"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
        }
      ~ tags_all                             = {
          ~ "Example"    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ "Name"       = "ex-terraform" -> "ex-terraform-aurora-postgresql"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 11 to add, 19 to change, 11 to destroy.

Changes to Outputs:
  ~ cluster_arn                                    = "arn:aws:rds:us-east-1:421195411089:cluster:ex-terraform" -> (known after apply)
  ~ cluster_endpoint                               = "ex-terraform.cluster-c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
  ~ cluster_engine_version_actual                  = "14.7" -> (known after apply)
  ~ cluster_hosted_zone_id                         = "Z2R2ITUGPM61AM" -> (known after apply)
  ~ cluster_id                                     = "ex-terraform" -> (known after apply)
  ~ cluster_instances                              = {
      ~ "1" = {
          ~ arn                                   = "arn:aws:rds:us-east-1:421195411089:db:ex-terraform-1" -> (known after apply)
          ~ availability_zone                     = "us-east-1c" -> (known after apply)
          ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
          ~ cluster_identifier                    = "ex-terraform" -> (known after apply)
          ~ custom_iam_instance_profile           = "" -> null
          ~ db_parameter_group_name               = "ex-terraform-20231123143328630300000002" -> (known after apply)
          ~ db_subnet_group_name                  = "ex-terraform" -> "ex-terraform-aurora-postgresql"
          ~ dbi_resource_id                       = "db-FRP7P3DQPJWMZY5VRWACCY5PGA" -> (known after apply)
          ~ endpoint                              = "ex-terraform-1.c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
          ~ engine_version_actual                 = "14.7" -> (known after apply)
          ~ id                                    = "ex-terraform-1" -> (known after apply)
          ~ identifier                            = "ex-terraform-1" -> "ex-terraform-aurora-postgresql-1"
          ~ identifier_prefix                     = "" -> (known after apply)
          ~ kms_key_id                            = "arn:aws:kms:us-east-1:421195411089:key/9ca9be06-f261-4e2d-a661-91b797bc2b51" -> (known after apply)
          ~ monitoring_role_arn                   = "" -> (known after apply)
          ~ network_type                          = "IPV4" -> (known after apply)
          ~ performance_insights_enabled          = false -> (known after apply)
          ~ performance_insights_kms_key_id       = "" -> (known after apply)
          ~ performance_insights_retention_period = 0 -> (known after apply)
          ~ port                                  = 5432 -> (known after apply)
          ~ preferred_backup_window               = "02:00-03:00" -> (known after apply)
          ~ storage_encrypted                     = true -> (known after apply)
          ~ tags                                  = {
              ~ Example    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
                GithubOrg  = "terraform-aws-modules"
                GithubRepo = "terraform-aws-rds-aurora"
            }
          ~ tags_all                              = {
              ~ Example    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
                # (2 unchanged attributes hidden)
            }
          ~ writer                                = true -> (known after apply)
            # (11 unchanged attributes hidden)
        }
    }
  ~ cluster_master_user_secret                     = [
      - {
          - kms_key_id    = "arn:aws:kms:us-east-1:421195411089:key/d0e23840-2941-49e2-b07d-695185ef30d9"
          - secret_arn    = "arn:aws:secretsmanager:us-east-1:421195411089:secret:rds!cluster-0e78fb4d-42cd-4340-a1e4-417ee4b30082-JITI0g"
          - secret_status = "active"
        },
    ] -> (known after apply)
  ~ cluster_members                                = [] -> (known after apply)
  ~ cluster_reader_endpoint                        = "ex-terraform.cluster-ro-c32l5bavisii.us-east-1.rds.amazonaws.com" -> (known after apply)
  ~ cluster_resource_id                            = "cluster-ZF46UPCTWFEIPFTBZAKWV5KAUA" -> (known after apply)
  ~ db_cluster_activity_stream_kinesis_stream_name = "aws-rds-das-cluster-ZF46UPCTWFEIPFTBZAKWV5KAUA" -> (known after apply)
  ~ db_cluster_cloudwatch_log_groups               = {
      ~ postgresql = {
          ~ arn               = "arn:aws:logs:us-east-1:421195411089:log-group:/aws/rds/cluster/ex-terraform/postgresql" -> (known after apply)
          ~ id                = "/aws/rds/cluster/ex-terraform/postgresql" -> (known after apply)
          ~ kms_key_id        = "" -> null
          ~ name              = "/aws/rds/cluster/ex-terraform/postgresql" -> "/aws/rds/cluster/ex-terraform-aurora-postgresql/postgresql"
          ~ name_prefix       = "" -> (known after apply)
          ~ tags              = {
              ~ Example    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
                GithubOrg  = "terraform-aws-modules"
                GithubRepo = "terraform-aws-rds-aurora"
            }
          ~ tags_all          = {
              ~ Example    = "ex-terraform" -> "ex-terraform-aurora-postgresql"
                # (2 unchanged attributes hidden)
            }
            # (2 unchanged attributes hidden)
        }
    }
  ~ db_cluster_parameter_group_arn                 = "arn:aws:rds:us-east-1:421195411089:cluster-pg:ex-terraform-20231123143328628700000001" -> (known after apply)
  ~ db_cluster_parameter_group_id                  = "ex-terraform-20231123143328628700000001" -> (known after apply)
  ~ db_parameter_group_arn                         = "arn:aws:rds:us-east-1:421195411089:pg:ex-terraform-20231123143328630300000002" -> (known after apply)
  ~ db_parameter_group_id                          = "ex-terraform-20231123143328630300000002" -> (known after apply)
  ~ db_subnet_group_name                           = "ex-terraform" -> "ex-terraform-aurora-postgresql"
  ~ security_group_id                              = "sg-06bb6dce3b064e363" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mtrampic, Action: `pull_request`*